
"""
# 어떤 투자가 잘한것일까?
주식 투자 30% 이익
벤쳐 캐피탈 30% 이익
비트코인 30% 이익

주식 => 변동성 : 0.1 => 0.3/0.1 = 3
벤쳐 캐피탈 => 변동성 : 0.3 => 0.3/0.3 = 1
비트코인 => 변동성 : 0.9 => 0.3/0.9 = 0.33

- 주식이 비트코인보다 약 9배 잘한 투자이다.
이러한 수치를 Sharpe ratio 라고 한다.

# 투자를 하기 위해 고려해야 하는 기본적인 요소 3가지
- 예상(초과) 수익률 : (안전 자산 대비) 얼마나 추가적인 수익률을 얻을 수 있는가?
- 위험 : 자산 가격이 얼마나 변동성이 있는가? -> 시계열의 표준편차
- Sharpe Ratio : 예상 초과 수익률 / 위험

# 리스크
- 리스크는 return의 표준편차로 나타낼 수 있다.

# Sharpe ratio : 단위 리스크당 수익
- risk adjusted return

# 여러가지 상품에 투자할 경우 포트폴리오를 어떻게 하느지에 따라 총 수익과 변동성이 달라진다.
ex) 상품 A : 수익률 10%, 변동성 10%
    상품 B : 수익률 20%, 변동성 20%
    
    상품 A:B = 3:7
        수익률 17%
        변동성 16%
        수익률/변동성 = 1.06
    상품 A:B = 5:5
        수익률 15%
        변동성 14%
        수익률/변동성 = 1.07

# 수익률은 3:7이 높지만 변동성 차이로 인해 Sharpe ratio 차이가 있다.
따라서 리스크를 고려했을 경우 5:5 투자가 더 수익을 얻을 확률이 높다.
이러한 방식으로 포트폴리오를 분석하여 투자한다.
"""