# 클래스(Class) : 개발자에게 필요한 새로운 형식을 정의하는 것을 의미
# 속성과 데이터를 변형하는 함수를 같은 이름 공간에 묶음.
# 예시 ㅣ 직원클래스 : (사번데이터), (이름데이터), (부서코드), (입사 액션), (퇴사 액션)
# 예시 ㅣ 제품클래스 : (제품번호), (제품명), (설명), (제품등록액션), (수정액션)

# 인스턴스(Instance) : 클래스를 복사해서 생성한 복사본

# 객체지향 프로그래밍의 3가지 특징
# 1. 추상성 : 꼭 필요한 부분만 구현하는 것
# 2. 상속성 : 부모 클래스에서 공통부분을 상송받는 것
# 3. 다형성 : 동일한 인터페이스에 대해 구체적인 인스턴스마다 다른 동작을 할 수도 있는 것
# 객체 지향 프로그래밍을 사용한다는 것은 레고 블록처럼 조립을 통한 개발이 가능하다.

# 클래스의 정의 : 클래스의 멤버는 멤버 변수와 멤버 메서드로 구성

class Person:
    name = "Default Name"
    def print(self):
        print("My name is {0}".format(self.name))      # 클래스 생성

p1 = Person()       # 인스턴스 생성
p1.print()
p1.name = "전우치"
p1.print()