# 가변형(mutable) : 변경이 자유로운 형식 / 리스트, 딕셔너리

# 불변형(immutable) : 값을 초기화 하면 변경이 불가능한 정수형, 실수형, 문자열, 튜플
# 불변형은 새로운 값을 저장한 주소로 변경만 되고 실제 값이 변경되는 것은 아님.
a=1.2
print(id(a))
a=2.3
print(id(a))

# 불변형의 인자전달
#   파이썬에서 인자(입력되는 매개변수)는 참조(reference)를 이용해 전달
#   변경 가능한 변수와 변경 불가능한 변수일 때 처리 방식이 다름
#   함수 외부에 있는 불변 형식(정수형, 실수형)의 경우 
#   함수 내부에서 접근할 때 읽기만 가능함

# 가변형 데이터의 원본 보호
#   가변형의 경우, 함수의 인자로 전달되면,
#   내부에서 값을 변경했을 때 외부에서도 그 결과를 그대로 볼 수 있음
# 가변형
def change(x):
    x[0] = 'H'      #리스트는 변경 가능
wordlist = ['J','A','M']
change(wordlist)
print(wordlist)

# 불변형
def change1(x):
    x=x[:]  # x의 값을 복사해서 새로운 로컬 변수 x에 입력, 복사본을 만들어서 리턴해달라는 뜻.
    x[0] = 'H'
    return None
wordlist = ['J','A','M']
change1(wordlist)
print(wordlist)

# 실수로 값을 변경하는 것을 막으려면? : 불변형에 값을 담아둔다.
# 지속적으로 데이터의 추가 또는 삭제가 필요하다면? : 가변형인 리스트나 딕셔너리를 사용한다.